# National Income for East African Countries
This is the analysis of National Income for East African Countries namely, Tanzania, Kenya and Uganda. In the previous notebook `EAC_national_income.ipynb` we dealt with:
- Getting data, and
- Exporting data to CSV file.

In this notebook we concentrate on:
- Reading data
- Visualizing data

We use the following packages:

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pylab as plt
from sklearn.linear_model import LinearRegression as lr

In [2]:
# Reading the data
df = pd.read_csv('data/EAC_national_income.csv')
df.head(3)

         Date     Tanzania          Kenya      Uganda
0  1985-12-31  1850528.375  229418.453125  1731383.50
1  1986-12-31  1824326.500  238619.703125  1702750.75
2  1987-12-31  1834102.000  243700.234375  1770558.25

In [3]:
# Setting `Date` as an index for our DataFrame
df = df.set_index('Date')
df.tail(3)

              Tanzania          Kenya     Uganda
Date
2013-12-31  3312852.75  251548.343750  4343053.0
2014-12-31  3458366.25  255467.734375  4400128.5
2015-12-31  3573322.50  263548.500000  4471693.0